In [1]:
##############
#K. David Roell CFPB 7/12/16
#Compiles a report of all quality edit failures for HMDA LAR data
#
##############
import json
import os
import pandas as pd
import psycopg2
#from macro_sql import Q076 
with open('quality_sql.json') as f: #FIXME change to quality_sql.json and refactor the rest of code
    edit_sql = json.load(f)
    
#conn = psycopg2.connect("dbname=hmdamaster user=roellk") #connect and return connection
#cur = conn.cursor()#instantiate cursor object to use in SQL queries
#parameter format for local use #consider changing hmdamaster to roellk if db changes cause a fail
params = {
'dbname':'hmdamaster',
'user':'roellk',
'password':'',
'host':'localhost',

}

#connect_string = "dbname=%s user=%s host=%s password =%s" %(dbname, user, host, password) #set a string for connection to SQL
try:
    conn = psycopg2.connect(**params)
    cur = conn.cursor()
    print("i'm connected")

except psycopg2.Error as e: #if database connection results in an error print the following
    print("I am unable to connect to the database: ", e)


lar_tables = ['hmdalar2014', 'hmdalar2013', 'hmdalar2012', 'hmdalar2011', 'hmdalar2010', 'hmdalar2009'
             ,'hmdalar2008', 'hmdalar2007', 'hmdalar2006', 'hmdalar2005', 'hmdalar2004', 'hmdalar2003'
             ,'hmdalar2002', 'hmdalar2001', 'hmdalar2000', 'hmdalar1999', 'hmdalar1998', 'hmdalar1997'
             ,'hmdalar1996', 'hmdalar1995', 'hmdalar1994', 'hmdalar1993']
#edit_list = [item for item in dir(SQL_text) if not item.startswith("__")]

i'm connected

In [ ]:
def edit_text(table='hmdalar2014', edit_sql=edit_sql[0]['text'], edit_name=edit_sql[0]['name'], add_fields=[]):
    base_sql = """SELECT year, agency, COUNT(sequence) AS {edit_name} """.format(edit_name=edit_name)
    table_sql = "\nFROM {table}\n".format(table=table) 
    group_sql = """ GROUP BY year, agency"""
    for field in add_fields:
        base_sql = base_sql + ',' + field
        group_sql = group_sql + ', '+ field
    return_sql = base_sql + table_sql + edit_sql + group_sql + ';'
    print(return_sql)
    return return_sql

In [ ]:

fields=['RID']
for table in lar_tables:
    first = True
    for edit in edit_sql:
        name, text = edit['name'], edit['text']
        print(name)

        cur.execute(edit_text(table=table, edit_sql=text, edit_name=name, add_fields=fields))        
        data_df = pd.DataFrame(cur.fetchall())

        col_names = [desc[0] for desc in cur.description]
        if len(data_df.columns) == len(col_names):
            print('setting column names')
            data_df.columns = col_names

        if first == True and len(data_df.columns) > 0:
            quality_df = data_df.copy()
            first = False
                                 
        elif first == False and len(data_df.columns) > 0:
            print('merging dataframes')
            quality_df=quality_df.merge(data_df, how='outer', on=['agency', 'year', 'rid'])
    
        else:
            print('no data returned from query')
        
        print(quality_df.head())

    quality_df['arid'] = quality_df.agency.map(str) + quality_df.rid.map(str)
    quality_df.drop('rid', axis=1, inplace=True)
    path = 'quality/'
    if not os.path.exists(path):
        os.makedirs(path)
    quality_df.to_csv(path + 'quality_edits' + table[-4:] +'.csv', index=False)

Q035
SELECT year, agency, COUNT(sequence) AS Q035 ,RID
FROM hmdalar2014
WHERE loan_type != '1' AND purchaser IN  ('1','3') GROUP BY year, agency, RID;
setting column names
   year agency  q035         rid
0  2014      3     3  0000026967
1  2014      5     3  0000062542
2  2014      1     2  0000014062
3  2014      2     2  0000456157
4  2014      2     2  0000529958
Q001
SELECT year, agency, COUNT(sequence) AS Q001 ,RID
FROM hmdalar2014
WHERE amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' AND amount::int >= 1000 AND (amount::int / income::int) <= 5 GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001
0  2014      3   3.0  0000026967   1.0
1  2014      5   3.0  0000062542   NaN
2  2014      1   2.0  0000014062   3.0
3  2014      2   2.0  0000456157   NaN
4  2014      2   2.0  0000529958   NaN
Q002
SELECT year, agency, COUNT(sequence) AS Q002 ,RID
FROM hmdalar2014
WHERE property_type = '1' AND income NOT ILIKE '%NA%' AND amount NOT ILIKE '%NA%' AND income::INT >= 200 AND amount::INT >= 2000 GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002
0  2014      3   3.0  0000026967   1.0   NaN
1  2014      5   3.0  0000062542   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN
3  2014      2   2.0  0000456157   NaN   NaN
4  2014      2   2.0  0000529958   NaN   NaN
Q003
SELECT year, agency, COUNT(sequence) AS Q003 ,RID
FROM hmdalar2014
WHERE loan_type = '2' AND property_type in ('1', '2') AND amount::INT > 626 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003
0  2014      3   3.0  0000026967   1.0   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN
3  2014      2   2.0  0000456157   NaN   NaN   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN
Q004
SELECT year, agency, COUNT(sequence) AS Q004 ,RID
FROM hmdalar2014
WHERE loan_type = '3' AND property_type IN ('1', '2') AND amount::INT > 1050 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN
Q005
SELECT year, agency, COUNT(sequence) AS Q005 ,RID
FROM hmdalar2014
WHERE purchaser IN ('1', '2', '3', '4') AND property_type IN ('1', '2') AND amount::INT > 1203 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN
Q013
SELECT year, agency, COUNT(sequence) AS Q013 ,RID
FROM hmdalar2014
WHERE property_type = '3' AND amount::INT >= 100 AND amount::INT <= 10000 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN
Q036
SELECT year, agency, COUNT(sequence) AS Q036 ,RID
FROM hmdalar2014
WHERE property_type = '2' AND amount::INT > 150 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Q037
SELECT year, agency, COUNT(sequence) AS Q037 ,RID
FROM hmdalar2014
WHERE lien = '2' AND amount::INT > 250 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037
0   2.0
1   NaN
2   NaN
3   1.0
4   NaN
Q038
SELECT year, agency, COUNT(sequence) AS Q038 ,RID
FROM hmdalar2014
WHERE lien = '3' AND amount::INT > 100 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038
0   2.0   NaN
1   NaN   NaN
2   NaN   NaN
3   1.0   NaN
4   NaN   NaN
Q025
SELECT year, agency, COUNT(sequence) AS Q025 ,RID
FROM hmdalar2014
WHERE loan_purpose = '1' AND property_type = '1' AND amount::INT <=10 AND amount NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025
0   2.0   NaN   NaN
1   NaN   NaN   NaN
2   NaN   NaN   NaN
3   1.0   NaN   1.0
4   NaN   NaN   NaN
Q068
SELECT year, agency, COUNT(sequence) AS Q068 ,RID
FROM hmdalar2014
WHERE action IN ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity != '5' AND co_race1 != '8' AND co_sex != '5' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068
0   2.0   NaN   NaN   2.0
1   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN
3   1.0   NaN   1.0   3.0
4   NaN   NaN   NaN   NaN
Q014
SELECT year, agency, COUNT(sequence) AS Q014 ,RID
FROM hmdalar2014
WHERE income::INT >= 3000 AND income NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068  q014
0   2.0   NaN   NaN   2.0   NaN
1   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN
3   1.0   NaN   1.0   3.0   NaN
4   NaN   NaN   NaN   NaN   NaN
Q024
SELECT year, agency, COUNT(sequence) AS Q024 ,RID
FROM hmdalar2014
WHERE action = '1' AND (amount::INT / income::INT) >= 5 AND income::INT <= 9 AND income NOT ILIKE '%NA%' AND amount NOT ILIKE '%NA%'  GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068  q014  q024
0   2.0   NaN   NaN   2.0   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN   NaN
3   1.0   NaN   1.0   3.0   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN   NaN
Q027
SELECT year, agency, COUNT(sequence) AS Q027 ,RID
FROM hmdalar2014
WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND property_type IN ('1', '2') AND income ILIKE '%NA%'  GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068  q014  q024  q027
0   2.0   NaN   NaN   2.0   NaN   NaN   6.0
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN   NaN  43.0
3   1.0   NaN   1.0   3.0   NaN   NaN  28.0
4   NaN   NaN   NaN   NaN   NaN   NaN  20.0
Q067
SELECT year, agency, COUNT(sequence) AS Q067 ,RID
FROM hmdalar2014
WHERE action in ('1', '2', '3', '4', '5', '7', '8') AND ethnicity = '4' AND race = '7' AND sex = '4' AND co_ethnicity = '4' AND co_race1 = '7' AND co_sex = '4' AND income NOT ILIKE '%NA%' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068  q014  q024  q027  q067
0   2.0   NaN   NaN   2.0   NaN   NaN   6.0   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN   NaN  43.0   NaN
3   1.0   NaN   1.0   3.0   NaN   NaN  28.0   NaN
4   NaN   NaN   NaN   NaN   NaN   NaN  20.0   NaN
Q039
SELECT year, agency, COUNT(sequence) AS Q039 ,RID
FROM hmdalar2014
WHERE hoepa = '1' AND action = '1' AND rate_spread ILIKE '%NA%'  GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068  q014  q024  q027  q067  q039
0   2.0   NaN   NaN   2.0   NaN   NaN   6.0   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN   NaN  43.0   NaN   NaN
3   1.0   NaN   1.0   3.0   NaN   NaN  28.0   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN   NaN  20.0   NaN   NaN
Q040
SELECT year, agency, COUNT(sequence) AS Q040 ,RID
FROM hmdalar2014
WHERE purchaser IN ('1', '2', '3', '4') AND lien IN ('1', '2') AND (rate_spread NOT ILIKE '%NA%' AND rate_spread::REAL > 10) GROUP BY year, agency, RID;
no data returned from query
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  q036  \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN   NaN
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0   1.0
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0   NaN
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN   NaN

   q037  q038  q025  q068  q014  q024  q027  q067  q039
0   2.0   NaN   NaN   2.0   NaN   NaN   6.0   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN   NaN  43.0   NaN   NaN
3   1.0   NaN   1.0   3.0   NaN   NaN  28.0   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN   NaN  20.0   NaN   NaN
Q066
SELECT year, agency, COUNT(sequence) AS Q066 ,RID
FROM hmdalar2014
WHERE rate_spread NOT ILIKE '%NA%' and rate_spread::REAL >=13 GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  ...   \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN  ...
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN  ...
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0  ...
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0  ...
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN  ...

   q037  q038  q025  q068  q014  q024  q027  q067  q039  q066
0   2.0   NaN   NaN   2.0   NaN   NaN   6.0   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN   NaN  43.0   NaN   NaN   NaN
3   1.0   NaN   1.0   3.0   NaN   NaN  28.0   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN   NaN  20.0   NaN   NaN   NaN

[5 rows x 21 columns]
Q044
SELECT year, agency, COUNT(sequence) AS Q044 ,RID
FROM hmdalar2014
WHERE action = '1' AND lien = '1' AND rate_spread::REAL > 6.5 AND hoepa != '1' AND rate_spread NOT ILIKE '%NA%'  GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  ...   \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN  ...
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN  ...
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0  ...
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0  ...
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN  ...

   q038  q025  q068  q014  q024  q027  q067  q039  q066  q044
0   NaN   NaN   2.0   NaN   NaN   6.0   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN   NaN  43.0   NaN   NaN   NaN   NaN
3   NaN   1.0   3.0   NaN   NaN  28.0   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN  20.0   NaN   NaN   NaN   NaN

[5 rows x 22 columns]
Q045
SELECT year, agency, COUNT(sequence) AS Q045 ,RID
FROM hmdalar2014
WHERE action = '1' AND lien = '2' AND rate_spread::REAL > 8.5 AND hoepa != '1' AND rate_spread NOT ILIKE '%NA%'  GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  ...   \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN  ...
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN  ...
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0  ...
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0  ...
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN  ...

   q025  q068  q014  q024  q027  q067  q039  q066  q044  q045
0   NaN   2.0   NaN   NaN   6.0   NaN   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN  43.0   NaN   NaN   NaN   NaN   NaN
3   1.0   3.0   NaN   NaN  28.0   NaN   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN  20.0   NaN   NaN   NaN   NaN   NaN

[5 rows x 23 columns]
Q046
SELECT year, agency, COUNT(sequence) AS Q046 ,RID
FROM hmdalar2014
WHERE loan_purpose = '1' AND hoepa = '1' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  ...   \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN  ...
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN  ...
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0  ...
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0  ...
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN  ...

   q068  q014  q024  q027  q067  q039  q066  q044  q045  q046
0   2.0   NaN   NaN   6.0   NaN   NaN   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN  43.0   NaN   NaN   NaN   NaN   NaN   NaN
3   3.0   NaN   NaN  28.0   NaN   NaN   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN  20.0   NaN   NaN   NaN   NaN   NaN   NaN

[5 rows x 24 columns]
Q051
SELECT year, agency, COUNT(sequence) AS Q051 ,RID
FROM hmdalar2014
WHERE ethnicity = '4' AND race = '7' AND sex = '4' AND action = '6' AND hoepa = '1' GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  ...   \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN  ...
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN  ...
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0  ...
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0  ...
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN  ...

   q014  q024  q027  q067  q039  q066  q044  q045  q046  q051
0   NaN   NaN   6.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN   NaN  43.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
3   NaN   NaN  28.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4   NaN   NaN  20.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN

[5 rows x 25 columns]
Q052
SELECT year, agency, COUNT(sequence) AS Q052 ,RID
FROM hmdalar2014
WHERE property_type = '3' AND hoepa = '1'  GROUP BY year, agency, RID;
setting column names
merging dataframes
   year agency  q035         rid  q001  q002  q003  q004  q005  q013  ...   \
0  2014      3   3.0  0000026967   1.0   NaN   NaN   NaN   NaN   NaN  ...
1  2014      5   3.0  0000062542   NaN   NaN   NaN   NaN   NaN   NaN  ...
2  2014      1   2.0  0000014062   3.0   NaN   NaN   NaN   NaN   2.0  ...
3  2014      2   2.0  0000456157   NaN   NaN   NaN   NaN   NaN   5.0  ...
4  2014      2   2.0  0000529958   NaN   NaN   NaN   NaN   NaN   NaN  ...

   q024  q027  q067  q039  q066  q044  q045  q046  q051  q052
0   NaN   6.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN  43.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
3   NaN  28.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
4   NaN  20.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN

[5 rows x 26 columns]
Q064
SELECT year, agency, COUNT(sequence) AS Q064 ,RID
FROM hmdalar2014